Repository: karansorout/wphone_picflic
Catalog: PicFlic/AppResources.*.resx
Languages: fi_fi

# p1_aboutApp
source: SOURCE & LICENSE:The maintenance of your pictures over the Free Google Cloud Service nicknamed Picasa would be very easy using the application. This app uses the free picasa api and abides to their normal usages terms & conditions
fi_fi: LÄHDE ja LISENSSI: ylläpito kuvia yhä Free Google Cloud Service lempinimeltään Picasa olisierittäin helppo käyttääsovellus. Tämä sovellus käyttää vapaa Picasa api ja pysyy normaaliin usases ja ehdoin

# p1_alreadyPinned
source: PicFlic is already Pinned
fi_fi: PicFlic on jo Pinned

# p1_authFailed
source: Authentication failed, please cCheck your Email and Password
fi_fi: Todennus epäonnistui, ota CTarkista sähköpostisi ja salasana

# p1_btn_login
source: Login
fi_fi: käyttäjätunnus

# p1_chkBox_remember
source: Remember My Choice
fi_fi: Muista valintani

# p1_flickr_underconstruction_msg
source: Connection with Flickr is under construction...
fi_fi: Yhteydessä Flickr on rakenteilla ...

# p1_txtBlock_connect
source: Connect to...
fi_fi: Yhdistä ...

# p1_txtBlock_pwd
source: Password:
fi_fi: Salasana:

# p1_txtBlock_tagline
source: ***Flick your Pics in cloud***
fi_fi: *** Leffa Kuvia pilvessä ***

# p1_txtBlock_uname
source: Email:
fi_fi: Sähköposti:

# p1_unableToAuth
source: Unable to authrize from google, excetion=
fi_fi: Pysty authrize google, Suorituspäivämäärä =

# p1_user_msg_emptyfields
source: Either 'Username' or 'Password' is empty
fi_fi: Joko "Käyttäjätunnus" tai "salasana" on tyhjä

# p1_user_msg_invalidemail
source: Please enter a valid email address
fi_fi: Kirjoita voimassa oleva sähköpostiosoite

# p1_user_msg_login_sucess
source: connected to
fi_fi: kytketty

# p1_user_msg_selectdrive
source: Please choose the target drive...
fi_fi: Valitse kohde ajaa ...

# p2_2_txtBlock1
source: Please provide the album info:
fi_fi: Antakaa albumin tiedot:

# p2_2_txtBlock2
source: Album Name: *
fi_fi: Albumin nimi: *

# p2_2_txtBlock3
source: Description (Optional):
fi_fi: Kuvaus (valinnainen):

# p2_2_txtBlock_Private
source: Private
fi_fi: yksityinen

# p2_2_txtBlock_Public
source: Public
fi_fi: julkinen

# p2_2_txtBlock_Submit
source: Submit
fi_fi: esittää

# p2_2_txtBlock_Title
source: PicFlic>New Album Form
fi_fi: PicFlic> Uusi albumi Form

# p2_AlbumList_NullReturned
source: Cannot get albums data from Picasa server - null returned!
fi_fi: Ei pysty albumia tietoja Picasa server - null palannut!

# p2_CreateNewAlbumMenu
source: Create New Album
fi_fi: Luo uusi albumi

# p2_KeyNotFoundError
source: No Albums Found or Cannot load images from Picasa Server
fi_fi: Albumeja ei löydy tai ei voi ladata kuvia Picasa Server

# p2_webException
source: Cannot get albums data from Picasa server - web exception occured!
fi_fi: Ei pysty albumia tietoja Picasa server - web poikkeus tapahtui!

# p3_imageUploadedSuccess
source: Image Uploaded Successfully!
fi_fi: Kuvan siirto onnistui!

# p3_KeyNotFoundException
source: No images in the Album
fi_fi: Ei kuvia Album

# p3_webexception
source: Cannot load images from Picasa server!
fi_fi: Ei voi ladata kuvia Picasa-palvelin!

# p4_deletePic
source: DELETE PIC : Are you sure?
fi_fi: DELETE PIC: Oletko varma?

# p4_imgDeletedSuccess
source: Image DELETED successfully
fi_fi: Kuva deleted successfully

# p4_selectAlbumagain
source: Please select an album from previous page
fi_fi: Valitse albumi edelliseltä sivulta

# p1_aboutApp1
source: Main Features:
fi_fi: Tärkeimmät ominaisuudet:

# p1_aboutApp2
source: -Persistant Login to cloud service
fi_fi: -Pysyvät Kirjaudu pilvipalveluna

# p1_aboutApp3
source: -Create New Album, Upload new pics
fi_fi: -Luo uusi albumi, Lähetä uusia kuvia

# p1_aboutApp4
source: -Take a pic & upload directly
fi_fi: -Ota kuva ja lähetä suoraan

# p1_aboutApp5
source: -Zoom & pinch single picture view to enjoy HD pics
fi_fi: -Zoom & hyppysellinen yhden kuvan katselusta enoy HD kuvia

# p1_aboutApp6
source: -Delete unwanted pics easily while browsing pics
fi_fi: -Poista tarpeettomat kuvat helposti selaamisen kuvia
